read_verilog src/nibble_interface.v
read_verilog src/MAC_simple.v
read_verilog src/components/accumulator_17bit.v
read_verilog src/components/pipeline_registers.v
read_verilog src/components/input_registers.v
read_verilog src/components/change_detector.v
read_verilog src/tt_um_BryanKuang_mac_peripheral.v

read_liberty scripts/sky130_fd_sc_hd__tt_025C_1v80.lib

synth -top tt_um_BryanKuang_mac_peripheral
dfflibmap -liberty scripts/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty scripts/sky130_fd_sc_hd__tt_025C_1v80.lib

write_verilog scripts/netlist.v
